In [85]:
import pandas as pd

In [87]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
        'Marks':[98,89,99,87,90,83,99],
        'Gender':['Male','Female','Female','Male','Male',
                  'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 1. Display Top 3 Rows Of The Dataset

In [90]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

# 2. Check Last 3 Rows Of The Dataset

In [93]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 3. Find Shape Of Our Dataset (Number Of Rows And Number Of Columns)

In [96]:
df1.shape  # Shape is not a method, it is an attribute of Pandas Dataframe. # It will give output as a tuple.

(7, 3)

In [98]:
print('Number of Rows:' , df1.shape[0])
print('Number of Columns:' , df1.shape[1])

Number of Rows: 7
Number of Columns: 3

# 4. Get Information About Our Dataset Like [Total Number Of Rows], [Total Number Of Columns], [DataTypes Of Each Columns] and [Memory Requirement]

In [101]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

# 5. Check Null Values In The Dataset

In [104]:
df1.isnull().sum() # Null Value Count Column Wise

Name      0
Marks     0
Gender    0
dtype: int64

In [106]:
df1.isnull().sum(axis=0) # Null Value Count Column Wise

Name      0
Marks     0
Gender    0
dtype: int64

In [108]:
df1.isnull().sum(axis=1) # Null Value Count Row Wise

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

# 6. Get OverAll Statistics About The DataFrame

In [111]:
df1.describe() # By default, Describe method will display statistics of numerical column only.

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [113]:
df1.describe(include = 'all')  # to get statistics of all the columns

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [115]:
# MEans 50% values are below 90. These are percentile values.

# 7. Find Unique Values From The Gender Column

In [177]:
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [124]:
# Esc + B -> To Create a New Cell
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

# 8. Find The Number Of Unique Values From The Gender Column

In [127]:
df1['Gender'].nunique()

2

# 9. Display Count Of Unique Values In Gender Column

In [130]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [132]:
# Male Occurs 3 times in our dataframe
# Female Ociuurs 4 times in out dataframe.

# 10. Find Total Number Of Students Having Marks Between 90 To 100 (Inclusive) Using Between Method

In [135]:
# Method:1 (Without Between Method)
df1['Marks'] # Values of our marks column

0    98
1    89
2    99
3    87
4    90
5    83
6    99
Name: Marks, dtype: int64

In [137]:
df1['Marks']>=90  # A boolean series will be generated.

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [139]:
df1[df1['Marks']>=90]  # Passing the boolean series to our dataframe. (It will only display the row if it finds true value)

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [141]:
# Method 2:
# If two or more conditions are there, write it in Parenthesis.

(df1['Marks']>=90)  &  (df1['Marks']<=100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [143]:
# Now, PAssing it to our dataframe. It will return the table, where value is true.

df1[(df1['Marks']>=90)  &  (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [145]:
# Len function will give us the lenth of our dataframe
len(df1[(df1['Marks']>=90)  &  (df1['Marks']<=100)])

4

In [147]:
# Method :3(Between Method)
df1['Marks'].between(90,100)  # In between method, both should be integer.

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [149]:
# To find the count, we use Sum Function
sum(df1['Marks'].between(90,100))

4

# 11. Find Average Marks

In [152]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [154]:
df1['Marks'].min() # Minimum Marks

np.int64(83)

In [156]:
df1['Marks'].max() # Maximum Marks

np.int64(99)

In [158]:
df1['Marks'].mean() # Average Marks

np.float64(92.14285714285714)

# 12. Apply Method

In [161]:
# If we want to use our own Customized Method , for the above column
def marks(x):
    return x/2

In [163]:
df1['Marks'].apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [165]:
# Let us add this, to a new column
df1['Half_Marks'] = df1['Marks'].apply(marks)

In [167]:
df1   # New column is added

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [169]:
def marks(x):
    return x//2  # Using Floor Division, instead of Normal Division
df1['Marks'].apply(marks)
df1['Half_Marks'] = df1['Marks'].apply(marks)
df1   # New column is added with all decimal(floating) values gone

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [181]:
# Using Lambda Function , with Apply Method:

In [183]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

# Find Length Of Strings available in the Name Column

In [191]:
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [193]:
df1['Name'].apply(len)  # Applying Length Method, to that column

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

# 13. Map Function

In [198]:
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

# We want to perform Encoding, converting Male = 1, Female = 0. (Using Map Function)

In [208]:
df1['Gender'].map({'Male':1,'Female':0})

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

In [210]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [212]:
df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

# 14. Drop The Column(s)

In [216]:
df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [220]:
df1.drop('Male_Female',axis=1)  # Write the name of the column inside, and if you want to drop the column, then axis=1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [224]:
# If we want to drop multiple columns, then we'll use Python Lists
df1.drop(['Male_Female','Half_Marks'],axis=1)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [226]:
df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [230]:
# So, if we want to drop the data from existing data frame, we'll use inplace=True
df1.drop(['Male_Female','Half_Marks'],axis=1,inplace=True)

In [232]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 15. Print The Name Of The Columns

In [235]:
# It is not a method, it's an attribute of Pandas
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [241]:
df1.index   # Displaying Row Indexes

RangeIndex(start=0, stop=7, step=1)

# 16. Sort The DataFrame As Per The Marks Column

In [246]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [252]:
df1.sort_values(by='Marks') # By default, it will show ascending values

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [256]:
df1.sort_values(by='Marks',ascending=False)  # Sorting the dataframe by DESCENDING ORDER

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [264]:
# For Sorting Multiple Columns, at a time : We'll use Python Lists
df1.sort_values(by=['Marks','Gender'],ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

# 17. Display Name & Marks Of The Female Students

In [268]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [270]:
df1['Gender']

0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object

In [272]:
df1['Gender']=='Female'  # Comparing it with Female , to get Boolean Values

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [276]:
df1[df1['Gender']=='Female']  # It will only display the rows, with the true values

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female

In [287]:
df1[df1['Gender']=='Female'] [['Name','Marks']]  # Using 2D Lists, to show more than one column

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

# Solving The Question, with Pandas DataFrame

In [290]:
df1['Gender'].isin(['Female'])

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [292]:
df1[df1['Gender'].isin(['Female'])] [['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99